#  Introduction 
Working with data is most exciting job in 21st century. With this easily accessible internet technolgy and with abundance of data and freely available online sources to boost data anlysis skils available out there it has become easier for most of the people to dive in this field for either swithching to this career or accelerating present job or even for interest to invest in stock market. Understanding data and making inference out of it takes experience and a right track for starters. In this tutorial we will cover topics from as basic as dissecting data to advance as faster and parallel execution with "Ray" variant of Pandas.

In [2]:
import pandas as pd
import numpy as np

### Import BlackRock past one year Dataset (15 April 2018- 10 May 2019). This data is available in data folder. Some changes have been made in this data for this tutorial. ###

In [3]:
data = pd.read_csv('./data/BLK.csv')                            #change your path

In [3]:
data.shape          # prints (rows,columns)

(19, 7)

In [22]:
data.info() # number of non-missing values, data-type for each column and memory usage.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 8 columns):
Date         19 non-null object
Open         17 non-null float64
High         19 non-null float64
Low          19 non-null float64
Close        19 non-null float64
Adj Close    19 non-null float64
Volume       19 non-null int64
Range        19 non-null float64
dtypes: float64(6), int64(1), object(1)
memory usage: 1.3+ KB

Have understanding of data columns, data values by printing few entries. Following code prints first five examples of dataset. There are three things in dataframe to be taken care of for data crunching

* Index
* Columns
* Data values

Index and Column names make it easier to access a particular entry or subset of data.

In [4]:
data.head()         #prints 0-4 examples of data frame
# data.tail()       # prints last five entries of data

,Date,Open,High,Low,Close,Adj Close,Volume
0,4/15/2019,456.359985,457.100006,449.769989,451.859985,451.859985,590800
1,4/16/2019,453.100006,466.890015,453.000000,466.540009,466.540009,1030700
2,4/17/2019,466.980011,468.779999,462.420013,467.489990,467.489990,628200
3,4/18/2019,468.779999,469.369995,465.690002,465.690002,465.690002,530400
4,4/22/2019,463.750000,465.660004,462.149994,464.019989,464.019989,432900

In case, you want to print any number of row then you can just pass an argument to the head command.

In [5]:
data.head(10) # print first 10 rows of the dataset

,Date,Open,High,Low,Close,Adj Close,Volume
0,4/15/2019,456.359985,457.100006,449.769989,451.859985,451.859985,590800
1,4/16/2019,453.100006,466.890015,453.000000,466.540009,466.540009,1030700
2,4/17/2019,466.980011,468.779999,462.420013,467.489990,467.489990,628200
3,4/18/2019,468.779999,469.369995,465.690002,465.690002,465.690002,530400
4,4/22/2019,463.750000,465.660004,462.149994,464.019989,464.019989,432900
5,4/23/2019,464.000000,474.029999,463.899994,474.029999,474.029999,687400
6,4/24/2019,474.029999,482.369995,472.609985,480.170013,480.170013,1008500
7,4/25/2019,477.890015,480.480011,472.609985,474.450012,474.450012,598700
8,4/26/2019,475.109985,479.459991,471.850006,478.980011,478.980011,469000
9,4/29/2019,NaN,481.579987,478.609985,479.839996,479.839996,366900

In [69]:
print(data.columns)        # prints data column names
print(data.index)          # prints index name if any
#To set index name run following

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume'], dtype='object')
RangeIndex(start=0, stop=19, step=1)

Check the type of columns and indexes

In [70]:
print(type(data.columns))
print(type(data.index))

<class 'pandas.core.indexes.base.Index'>
<class 'pandas.core.indexes.range.RangeIndex'>

Both types seem closely related, infact pandas has number of similar objects reserved for either Index or column. Both Index and columns must be some kind of Index object. "issubclass" buildin method shows if RangeIndex is subclass of Index. Let's check

In [71]:
print(issubclass(pd.RangeIndex, pd.Index))

True

Now let's check for data types of columns

In [54]:
data.dtypes # return the datatypes for each column separately.

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
dtype: object

In [73]:
data.get_dtype_counts()      #counts of datatypes in dataframe.

float64    5
int64      1
object     1
dtype: int64

In [57]:
data.count()          # count of datatypes in dataframe for each column.

Date         19
Open         17
High         19
Low          19
Close        19
Adj Close    19
Volume       19
dtype: int64

In [77]:
print(open_data.min());
print(open_data.max());
print(open_data.mean());
print(open_data.median());
print(open_data.std());
print(open_data.sum());

453.10000599999995
486.839996
469.14000023529405
468.77999900000003
9.335423854402823
7975.380004

Now above statatistics could be found in one line of code i.e. `open_data.describe()`  (Please try yourself)

In [78]:
# get 0.2 quantile out of data
open_data.quantile(0.2)

461.91600339999997

In [79]:
# check if any null value
open_data.isnull()

'''
out []

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
Name: Open, dtype: bool
'''

# or
total_number_of_nulls = sum(open_data.isnull())
print(total_number_of_nulls)

2

In [5]:
data.isnull().sum() # count the NaNs for each column.
# to count all of the NaNs 
# dataframe data.isnull().sum().sum()

Date         0
Open         2
High         0
Low          0
Close        0
Adj Close    0
Volume       0
dtype: int64

In [9]:
data.isnull().any().any() # to check quickly wheather there is NaN or not.
# data.isnull().any() to quickcheck NaN's column-wise.

True

Fill NaNs with some number, Now this some number depends on business cases corresponsing data would have. Lets fill it with 0
for now

In [68]:
filled_open_data = open_data.fillna(0)
# to fill NaNs of specific type say int, run following command


fill_open_data = open_data.fillna(0).astype(int)
# check if any NaNs now?
filled_open_data.isnull().sum()

0

If one has enough data and information would not be lost much then one can drop particular row which is having null value.

In [73]:
dropped_open_data = open_data.dropna()
dropped_open_data.head()

0    456.359985
1    453.100006
2    466.980011
3    468.779999
4    463.750000
Name: Open, dtype: float64

Arithmetic Operations can be applied on Pandas series like positive, multiply, divide.

In [82]:
# addition of 1 in dropped_open_data column

add_dod = dropped_open_data + 1
mul_dod = dropped_open_data * 2
divide_dod = dropped_open_data // 3

print(add_dod.head())
print(mul_dod.head())

0    457.359985
1    454.100006
2    467.980011
3    469.779999
4    464.750000
Name: Open, dtype: float64
0    912.719970
1    906.200012
2    933.960022
3    937.559998
4    927.500000
Name: Open, dtype: float64

Following are three methods to change column names of dataframe

In [83]:
#Rename column names in pandas make list of new names and replace inplace with new names

#columns = ['date', 'open', 'high', 'low', 'close', 'Adj_close', 'vol']
#data.columns = columns

# rename and create new Dataframe
df = data.rename(columns={'Date': 'date', 'Open': 'open','High': 'high', 'Low':'low', 'Close':'close','Adj Close':'Adj_close','Volume':'vol'})

# Or rename the existing DataFrame (rather than creating a copy) 
#data.rename(columns={'Date': 'date', 'Open': 'open','High': 'high', 'Low':'low', 'Close':'close','Adj Close':'Adj_close','Volume':'vol'}, inplace=True)

Creating new column

In [84]:
# create new column with entries 0 (easiest one)
data['zero_risk'] = 0
#check column names in dataframe now
print('data columns after adding new column are :',data.columns)

data columns after adding new column are : Index(['Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume',
       'zero_risk'],
      dtype='object')

Sometimes it is helpful to access the data by sorting it accorting to a specific column. For example I want to access the data in increasing order of volume.

In [47]:
data.sort_values("Volume").head()  # By default it rearrange the data in ascending order. If descending order 
                            #is required then following command can be helpful.
#data.sort_values("Volume",ascending = False)

,Date,Open,High,Low,Close,Adj Close,Volume
9,4/29/2019,NaN,481.579987,478.609985,479.839996,479.839996,366900
13,5/3/2019,NaN,482.899994,476.410004,482.500000,482.500000,403300
4,4/22/2019,463.750000,465.660004,462.149994,464.019989,464.019989,432900
14,5/6/2019,472.920013,478.619995,469.869995,476.369995,476.369995,434400
17,5/9/2019,458.730011,464.459991,454.160004,464.220001,464.220001,435500

Pandas is able to run multiple operations in one go. For example,I want to sort the volumes and simultaneously willing to print first five rows of the data.

In [4]:
data.sort_values("Volume").head()

,Date,Open,High,Low,Close,Adj Close,Volume
9,4/29/2019,NaN,481.579987,478.609985,479.839996,479.839996,366900
13,5/3/2019,NaN,482.899994,476.410004,482.500000,482.500000,403300
4,4/22/2019,463.750000,465.660004,462.149994,464.019989,464.019989,432900
14,5/6/2019,472.920013,478.619995,469.869995,476.369995,476.369995,434400
17,5/9/2019,458.730011,464.459991,454.160004,464.220001,464.220001,435500

Any operation applied on the data set never alter the original data. From the above operations it seems that I have sorted the original data. Let's take a look at the original data.

In [5]:
data.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,4/15/2019,456.359985,457.100006,449.769989,451.859985,451.859985,590800
1,4/16/2019,453.100006,466.890015,453.000000,466.540009,466.540009,1030700
2,4/17/2019,466.980011,468.779999,462.420013,467.489990,467.489990,628200
3,4/18/2019,468.779999,469.369995,465.690002,465.690002,465.690002,530400
4,4/22/2019,463.750000,465.660004,462.149994,464.019989,464.019989,432900

Well!! it still same as original data. Now what should I do if I required to alter the original data.

In [6]:
data.sort_values("Volume", inplace = True) # inplace command alter the original data.
data.head()

,Date,Open,High,Low,Close,Adj Close,Volume
9,4/29/2019,NaN,481.579987,478.609985,479.839996,479.839996,366900
13,5/3/2019,NaN,482.899994,476.410004,482.500000,482.500000,403300
4,4/22/2019,463.750000,465.660004,462.149994,464.019989,464.019989,432900
14,5/6/2019,472.920013,478.619995,469.869995,476.369995,476.369995,434400
17,5/9/2019,458.730011,464.459991,454.160004,464.220001,464.220001,435500

```sort_values``` is able to do more than that. It can sort the multiple columns in a single command. The list of the columns should be passed to the ```sort_values``` command. The order of the sorting is same as the list passed to the command. For example, in ```data.sort_values(["High", "Low"])``` <font color = "orange">High</font> sorted first and then <font color = "orange">Low</font>.

In [46]:
data.sort_values(["High", "Low"]).head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,4/15/2019,456.359985,457.100006,449.769989,451.859985,451.859985,590800
17,5/9/2019,458.730011,464.459991,454.160004,464.220001,464.220001,435500
18,5/10/2019,461.850006,465.640015,453.250000,463.000000,463.000000,484000
4,4/22/2019,463.750000,465.660004,462.149994,464.019989,464.019989,432900
1,4/16/2019,453.100006,466.890015,453.000000,466.540009,466.540009,1030700

**Great!!!** We are able to sort the data in different manner. But there are few ```NaN``` in <font color = "red">Open</font> column. What to do with that? By default, all the ```NaN```'s are at the end but if we need to keep the ```NaN```'s in the begining, then use the ```data.sort_values("Open", na_postion = first)```

In [45]:
data.sort_values("Open",na_position = "first").head()

,Date,Open,High,Low,Close,Adj Close,Volume
9,4/29/2019,NaN,481.579987,478.609985,479.839996,479.839996,366900
13,5/3/2019,NaN,482.899994,476.410004,482.500000,482.500000,403300
1,4/16/2019,453.100006,466.890015,453.000000,466.540009,466.540009,1030700
0,4/15/2019,456.359985,457.100006,449.769989,451.859985,451.859985,590800
17,5/9/2019,458.730011,464.459991,454.160004,464.220001,464.220001,435500

Now, Let's get the original data again.

In [21]:
data.sort_index(inplace = True) # sort the data according to the index.

### How to select the data

__to select the column:__
Sometimes it is helpful to access some specific columns for better vizualization of the data. Pandas allows this in very simple manner. Here let's access the "High" and "Low" only. A list needed columns should be passed to the data.

In [25]:
data[["High","Low"]] # selecting the column High and Low only.
data[["High","Low"]].head()

         High         Low
0  457.100006  449.769989
1  466.890015  453.000000
2  468.779999  462.420013
3  469.369995  465.690002
4  465.660004  462.149994

Pandas is allow to select the data in the more specific manner. For example, we wish to select the columns having numbers only.

In [4]:
data.select_dtypes(include=['number']).head()

         Open        High         Low       Close   Adj Close   Volume
0  456.359985  457.100006  449.769989  451.859985  451.859985   590800
1  453.100006  466.890015  453.000000  466.540009  466.540009  1030700
2  466.980011  468.779999  462.420013  467.489990  467.489990   628200
3  468.779999  469.369995  465.690002  465.690002  465.690002   530400
4  463.750000  465.660004  462.149994  464.019989  464.019989   432900

```filter``` method in pandas is also very felxible in selecting the data. It take a list or string to filter the data.

In [48]:
data.filter(["High","Low"]).head() # .head() can be ommited. It is just added to reduce the output data.

         High         Low
0  457.100006  449.769989
1  466.890015  453.000000
2  468.779999  462.420013
3  469.369995  465.690002
4  465.660004  462.149994

```filter``` method has an argument ```like```. It takes a string and return all of the columns with heading which includes the provided string.

In [27]:
data.filter(like="o").head() # will return all the columns consisting "o".

          Low       Close   Adj Close   Volume
0  449.769989  451.859985  451.859985   590800
1  453.000000  466.540009  466.540009  1030700
2  462.420013  467.489990  467.489990   628200
3  465.690002  465.690002  465.690002   530400
4  462.149994  464.019989  464.019989   432900

__selecting the complete row__

Above method can also be used to access the multiple rows at the same time. Passing a list of the indices of the row to be select.

In [17]:
data.loc[[0,2,3,5,8]]

,Date,Open,High,Low,Close,Adj Close,Volume
0,4/15/2019,456.359985,457.100006,449.769989,451.859985,451.859985,590800
2,4/17/2019,466.980011,468.779999,462.420013,467.489990,467.489990,628200
3,4/18/2019,468.779999,469.369995,465.690002,465.690002,465.690002,530400
5,4/23/2019,464.000000,474.029999,463.899994,474.029999,474.029999,687400
8,4/26/2019,475.109985,479.459991,471.850006,478.980011,478.980011,469000

** Accessing a particular entry from dataframe. **
Python has number of in-built containers like lists, dictionary, tuple , each of which uses index to access element. In similar fashion Pandas has dataframe as complex container which uses index or column names to access data point.

In [15]:
# Access with Column name

data['Open']      #fetches "Open" pandas series
# one can rename this pandas series if one has to work with sigle column only
open_data = data['Open']
open_data.head()

0    456.359985
1    453.100006
2    466.980011
3    468.779999
4    463.750000
Name: Open, dtype: float64

Above method is recommended but there is another dot method i.e. `data.Open` to access columns, which is quite error prone. You can not access column if the dataframe has column names with special characters and spaces in it as well as if column name is same as pandas DataFrame method name.

In [18]:
# Access complete row with index 
data.iloc[0]

Date         4/15/2019
Open            456.36
High             457.1
Low             449.77
Close           451.86
Adj Close       451.86
Volume          590800
Name: 0, dtype: object

The above method can also be used to select the multiple rows by passing a list of indices of required rows.

In [19]:
data.loc[[0,2,3,5,8]]

,Date,Open,High,Low,Close,Adj Close,Volume
0,4/15/2019,456.359985,457.100006,449.769989,451.859985,451.859985,590800
2,4/17/2019,466.980011,468.779999,462.420013,467.489990,467.489990,628200
3,4/18/2019,468.779999,469.369995,465.690002,465.690002,465.690002,530400
5,4/23/2019,464.000000,474.029999,463.899994,474.029999,474.029999,687400
8,4/26/2019,475.109985,479.459991,471.850006,478.980011,478.980011,469000

In [7]:
data_ugds_ = data.filter(like='UGDS_')

### How to use operations on dataframe?

There are number of operations which are quite helpful to make data more sensible. For example, adding a new column whose values are based on the two columns. 
Here the range of the price fluctutations for a particular day to be calculate just by taking the difference of the  ```"High"``` and ```"Low"``` column.

In [16]:
data['Range'] = data['High']-data['Low'] # to calulate the range and putting into a new column.

In [17]:
data.head()

,Date,Open,High,Low,Close,Adj Close,Volume,Range
0,4/15/2019,456.359985,457.100006,449.769989,451.859985,451.859985,590800,7.330017
1,4/16/2019,453.100006,466.890015,453.000000,466.540009,466.540009,1030700,13.890015
2,4/17/2019,466.980011,468.779999,462.420013,467.489990,467.489990,628200,6.359986
3,4/18/2019,468.779999,469.369995,465.690002,465.690002,465.690002,530400,3.679993
4,4/22/2019,463.750000,465.660004,462.149994,464.019989,464.019989,432900,3.510010

* whenever a column is subjected under an operation then the all of the NaN's in that column remains NaN.

By default, all the operations are operated according to the columns but if operations according to the row, then ```axis``` will help us to do so. The ```axis``` has two possible values ```0 or 1```. By default, it is ```0```. Passing the ```axis=1``` operates all the operations by taking the transpose of the data.

In [33]:
data.count(axis = 1).head() # counting the non-missing values of the data for each row.

0    8
1    8
2    8
3    8
4    8
dtype: int64

To take the sum of the all of the columns and adding it into a new row following procedure can be followed.

* Creating a copy of dataframe so that our original data remains intact therefore ```agg_data = data[data.columns]``` is preferred over the ```agg_data = data```.

In [124]:
agg_data = data[data.columns]

* adding the all values of the required columns and then appending it to the dataframe.

In [125]:
agg_data.loc['Total']= agg_data[["Open","High", "Low", "Close", "Adj Close", "Volume"]].sum() # run this only once to avoid 
                                                                                              # repeated sum.
#agg_data.loc['Total']= agg_data[data.columns].sum() (This command is avoided because the sum of Date column is not required)

In [126]:
agg_data.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
15,5/7/2019,473.609985,473.929993,459.059998,463.769989,463.769989,709500.0
16,5/8/2019,462.179993,469.459991,459.619995,465.470001,465.470001,454800.0
17,5/9/2019,458.730011,464.459991,454.160004,464.220001,464.220001,435500.0
18,5/10/2019,461.850006,465.640015,453.250000,463.000000,463.000000,484000.0
Total,NaN,7975.380004,9014.200012,8852.729948,8959.179991,8959.179991,10757300.0

### How to a analyse the data?

In [30]:
data.describe() #(summary statistics for the numerical columns and transpose the DataFrame for more readable output)

,Open,High,Low,Close,Adj Close,Volume,Range
count,17.000000,19.000000,19.000000,19.000000,19.000000,1.900000e+01,19.000000
mean,469.140000,474.431580,465.933155,471.535789,471.535789,5.661737e+05,8.498424
std,9.335424,8.471016,9.384924,8.721189,8.721189,1.861070e+05,3.198445
min,453.100006,457.100006,449.769989,451.859985,451.859985,3.669000e+05,2.970002
25%,462.179993,467.835007,459.339997,464.845001,464.845001,4.358000e+05,6.910004
50%,468.779999,474.029999,465.690002,474.029999,474.029999,4.886000e+05,8.700012
75%,475.109985,481.029999,472.609985,479.055008,479.055008,6.134500e+05,9.985000
max,486.839996,487.450012,478.709991,485.239990,485.239990,1.030700e+06,14.869995